app/controllers/cards_controller.rb

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @card = Card.new
    @deck = Deck.find(params[:deck_id])

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "rounds".* FROM "rounds" WHERE "rounds"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "guesses".* FROM "guesses" WHERE "guesses"."round_id" = $1 AND "guesses"."card_id" = $2 LIMIT $3  [["round_id", 12], ["card_id", 1], ["LIMIT", 1]]
---
  def show
    @card = Card.find_by(id: params[:id])
    @round = Round.find_by(id: params[:round_id])
    @guess = Guess.find_by(round_id: @round.id, card_id: @card.id)

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "cards" ("question", "answer", "deck_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["question", "Will this work?"], ["answer", "I hope so."], ["deck_id", 1], ["user_id", 1], ["created_at", "2017-08-28 23:01:04.869424"], ["updated_at", "2017-08-28 23:01:04.869424"]]
---
  def create
    @card = Card.new(card_params)
    @card.user = current_user
    @card.deck = Deck.find(params[:deck_id])
    if @card.save