app/controllers/decks_controller.rb

  def show
    @deck = Deck.find_by(id: params[:id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]