app/controllers/guesses_controller.rb

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @guess = Guess.create(guess_params)
    @card = Card.find_by(id: params[:card_id])