app/controllers/rounds_controller.rb

  def create
    @round = Round.new
    @round.user = current_user
    @round.deck = Deck.find(params[:deck_id])
    @round.save
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "rounds" ("user_id", "deck_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["deck_id", 1], ["created_at", "2017-08-28 23:18:25.058979"], ["updated_at", "2017-08-28 23:18:25.058979"]]